In [1]:
import pandas as pd

In [2]:
df_exams = pd.read_csv('./StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [ ]:
#it will count the number of unique values in the column
df_exams['race/ethnicity'].value_counts()

race/ethnicity
group C    319
group D    262
group B    190
group E    140
group A     89
Name: count, dtype: int64

In [6]:
#it will find the relative frequency of the values
df_exams['gender'].value_counts(normalize=True)

gender
female    0.518
male      0.482
Name: proportion, dtype: float64

In [11]:
import pandas as pd

# Sample DataFrame
df = pd.DataFrame({
    'Name': ['Ali', 'Sara', 'John', 'Sara', 'Ali', 'John', 'Ali'],
    'City': ['Lahore', 'Karachi', 'Lahore', 'Lahore', 'Islamabad', 'Karachi', 'Lahore'],
    'Gender': ['M', 'F', 'M', 'F', 'M', 'M', 'M'],
    'Marks': [85, 90, 78, 88, 85, 78, 90]
})

print("Original DataFrame:")
print(df)

# ðŸ§  PRACTICE QUESTIONS:

# Q1: Count how many times each Name appears.
df['Name'].value_counts()
# Q2: Count how many students are from each City.
df['City'].value_counts()
# Q3: Count how many students belong to each Gender.
df['Gender'].value_counts()
# Q4: Count how many times each Marks value appears.
df["Marks"].value_counts()
# Q5: Count how many times each Name appears, including percentages.
df['Name'].value_counts(normalize=True)

Original DataFrame:
   Name       City Gender  Marks
0   Ali     Lahore      M     85
1  Sara    Karachi      F     90
2  John     Lahore      M     78
3  Sara     Lahore      F     88
4   Ali  Islamabad      M     85
5  John    Karachi      M     78
6   Ali     Lahore      M     90

Name
Ali     0.428571
Sara    0.285714
John    0.285714
Name: proportion, dtype: float64